//
//  Test.swift
//  ListOfCurrencies
//
//  Created by Егор Даншов on 23/7/21.
//


/*
Просим выполнить ТЗ
 
Сделано:
1. Launch screen c иконкой 64x64 в середине экрана.
 

Нужно сделать:
2. На главном экране таблица с отображением списка валют.
3. Высота ячейки - 50.
4. Список валют загружается по ссылке: https://www.cbr-xml-daily.ru/daily_json.js
5. В ячейках таблицы отображаются название, курс валюты и код.
    - Название валюты - поле «Name».
    - Цена - поле «Value». В Value отображается 2 знака после запятой.
    - Код - поле «CharCode».
6. Данные в таблице обновляются каждые 30 секунд.
7. Кнопка ручного обновления данных в навигационном меню.
*/
